================================================================================
Set statement
================================================================================

set x to 5

--------------------------------------------------------------------------------

(source_file
  (set_statement
    (keyword_set)
    variable: (identifier)
    value: (number)))

================================================================================
Set statement with string
================================================================================

set myName to "Hello World"

--------------------------------------------------------------------------------

(source_file
  (set_statement
    (keyword_set)
    variable: (identifier)
    value: (string)))

================================================================================
Copy statement
================================================================================

copy "test" to myVar

--------------------------------------------------------------------------------

(source_file
  (copy_statement
    (keyword_copy)
    value: (string)
    variable: (identifier)))

================================================================================
Return statement
================================================================================

return true

--------------------------------------------------------------------------------

(source_file
  (return_statement
    (keyword_return)
    (boolean)))

================================================================================
Return statement without value
================================================================================

return

--------------------------------------------------------------------------------

(source_file
  (return_statement
    (keyword_return)))

================================================================================
Global declaration
================================================================================

global myGlobal

--------------------------------------------------------------------------------

(source_file
  (global_declaration
    (keyword_global)
    (identifier)))

================================================================================
Local declaration with multiple variables
================================================================================

local x, y, z

--------------------------------------------------------------------------------

(source_file
  (local_declaration
    (keyword_local)
    (identifier)
    (identifier)
    (identifier)))

================================================================================
Property declaration
================================================================================

property myProp : "default value"

--------------------------------------------------------------------------------

(source_file
  (property_declaration
    (keyword_property)
    name: (identifier)
    value: (string)))
